/*BOJ_)14500번 테트로미노
		b_d_o_o		*/
#include <iostream>
#include <algorithm>
using namespace std;
int paper[500][500];
int result = 0;
int N, M;
int loc[19][4][2]= {
	{{0, 0}, {0, 1}, {0, 2}, {0, 3}},
	{{0, 0}, {1, 0}, {2, 0}, {3, 0}},
	{{0, 0}, {1, 0}, {0, 1}, {1, 1}},
	{{0, 0}, {1, 0}, {1, 1}, {2, 1}},
	{{0, 0}, {0, 1}, {-1, 1}, {-1, 2}},
	{{0, 0}, {1, 0}, {0, 1}, {-1, 1}},
	{{0, 0}, {0, 1}, {1, 1}, {1, 2}},
	{{0, 0}, {1, 0}, {2, 0}, {1, -1}},
	{{0, 0}, {1, 0}, {2, 0}, {1, 1}},
	{{0, 0}, {0, 1}, {0, 2}, {1, 1}},
	{{0, 0}, {0, 1}, {0, 2}, {-1, 1}},
	{{0, 0}, {1, 0}, {2, 0}, {2, 1}},
	{{0, 0}, {1, 0}, {2, 0}, {2, -1}},
	{{0, 0}, {1, 0}, {2, 0}, {0, -1}},
	{{0, 0}, {1, 0}, {2, 0}, {0, 1}},
	{{0, 0}, {0, 1}, {0, 2}, {1, 2}},
	{{0, 0}, {0, 1}, {0, 2}, {-1, 2}},
	{{0, 0}, {0, 1}, {0, 2}, {-1, 0}},
	{{0, 0}, {0, 1}, {0, 2}, {1, 0}}
};
void tetro(int x, int y);
int main() {
	cin >> N >> M;
	for (int i = 0;i < N;i++) {
		for (int j = 0;j < M;j++) {
			cin>>paper[i][j];
		}
	}
	for (int i = 0;i < N;i++) {
		for (int j = 0;j < M;j++) {
			tetro(i, j);
		}
	}
	cout << result;
	return 0;
}
void tetro(int x, int y) {
	for (int i = 0;i < 19;i++) {
		int sum = 0;
		int cnt = 0;
		for (int j = 0;j < 4;j++) {
			int dx = x + loc[i][j][0];
			int dy = y + loc[i][j][1];
			if (dx>=0 && dx < N && dy>=0 && dy < M) {
				sum += paper[dx][dy];
				cnt++;
			}
		}
		if (cnt == 4) {
			result = max(result, sum);
		}
	}
	return;
}